In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [4]:
np.random.seed(101)

In [5]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['w','x','y','z'])

In [6]:
df

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [6]:
df['z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: z, dtype: float64

In [7]:
df[['w','x']]

          w         x
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [8]:
df['new']=df['w']+df['y']

In [9]:
df

          w         x         y         z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [12]:
df.drop('new',axis=1,inplace=True)

In [13]:
df

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df.drop('E',axis=0)

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [15]:
df.shape

(5, 4)

In [16]:
df

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
#selecting rows
#two ways

In [18]:
df.loc['A']

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: A, dtype: float64

In [19]:
df.iloc[2]

w   -2.018168
x    0.740122
y    0.528813
z   -0.589001
Name: C, dtype: float64

In [20]:
#subset
#df.loc[row,col]

In [21]:
df

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df.loc['D','z']

0.9550565092637361

In [23]:
df.loc[['A','B'],['w','y']]

          w         y
A  2.706850  0.907969
B  0.651118 -0.848077

In [7]:
df>0

       w      x      y      z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [8]:
df[df>0]

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
df['w']>0

A     True
B     True
C    False
D     True
E     True
Name: w, dtype: bool

In [10]:
#only return true value
df[df['w']>0]

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
#select all row where coloumn value w>0 then select particular x coloumn

In [12]:
df[df['w']>0]

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
df[df['w']>0]['x']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: x, dtype: float64

In [15]:
df[df['w']>0][['x','y']]

          x         y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [16]:
df[(df['w']>0) & (df['x']>1) ]

          w         x         y         z
E  0.190794  1.978757  2.605967  0.683509

In [17]:
df.reset_index()

  index         w         x         y         z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [18]:
df

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
newind='CA NY WY OR CO'.split()

In [20]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [21]:
df['states']=newind

In [22]:
df

          w         x         y         z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [23]:
df.set_index('states')

               w         x         y         z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [3]:
#Index level
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [5]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [6]:
#(data,index or row,coloumn)
df1=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [7]:
df1

             A         B
G1 1  1.622062  0.879899
   2  0.531006  0.418077
   3 -1.747085  1.066383
G2 1 -1.844104  0.000330
   2  1.158117 -1.106504
   3 -1.277521  0.853001

In [11]:
df1.loc['G1']

          A         B
1  1.622062  0.879899
2  0.531006  0.418077
3 -1.747085  1.066383

In [10]:
df1.loc['G1'].loc[1]

A    1.622062
B    0.879899
Name: 1, dtype: float64

In [12]:
df1.index.names

FrozenList([None, None])

In [13]:
df1.index.names=['Group','Numbers']

In [14]:
df1

                      A         B
Group Numbers
G1    1        1.622062  0.879899
      2        0.531006  0.418077
      3       -1.747085  1.066383
G2    1       -1.844104  0.000330
      2        1.158117 -1.106504
      3       -1.277521  0.853001

In [15]:
#grab -1.106504
df1.loc['G2'].loc[2]['B']

-1.1065039914109627

In [16]:
df1.xs(1,level='Numbers')

              A         B
Group
G1     1.622062  0.879899
G2    -1.844104  0.000330